{
  "nbformat": 4,
  "nbformat_minor": 0,
  "metadata": {
    "colab": {
      "name": "py2neo creates patient journey.ipynb",
      "version": "0.3.2",
      "provenance": []
    },
    "kernelspec": {
      "display_name": "Python 3",
      "language": "python",
      "name": "python3"
    }
  },
  "cells": [
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "view-in-github",
        "colab_type": "text"
      },
      "source": [
        "[View in Colaboratory](https://colab.research.google.com/github/Xueping/colab_ml/blob/master/py2neo_creates_patient_journey.ipynb)"
      ]
    },
    {
      "metadata": {
        "id": "j3kQlmZAjXXx",
        "colab_type": "code",
        "colab": {}
      },
      "cell_type": "code",
      "source": [
        "from py2neo import Graph, Node, Relationship,authenticate\n",
        "import numpy as np\n",
        "import pandas as pd"
      ],
      "execution_count": 0,
      "outputs": []
    },
    {
      "metadata": {
        "id": "vAzxXfXAjXX2",
        "colab_type": "code",
        "colab": {}
      },
      "cell_type": "code",
      "source": [
        "# set up authentication parameters\n",
        "authenticate(\"localhost:7474\", \"neo4j\", \"admin\")\n",
        "\n",
        "# connect to authenticated graph database\n",
        "graph = Graph(\"http://localhost:7474/db/data/\")\n",
        "# grapp = Graph()"
      ],
      "execution_count": 0,
      "outputs": []
    },
    {
      "metadata": {
        "id": "Z1PqQU51jXX5",
        "colab_type": "code",
        "colab": {}
      },
      "cell_type": "code",
      "source": [
        "patients = pd.read_csv('../doh/mimic3/data/PATIENTS.csv')\n",
        "admissions = pd.read_csv('../doh/mimic3/data/ADMISSIONS.csv')"
      ],
      "execution_count": 0,
      "outputs": []
    },
    {
      "metadata": {
        "id": "oIioeevsjXX7",
        "colab_type": "code",
        "colab": {}
      },
      "cell_type": "code",
      "source": [
        "unique_pats = admissions.SUBJECT_ID.unique()\n",
        "profs = pd.merge(admissions,patients,how='left',on='SUBJECT_ID').\\\n",
        "            drop(['ROW_ID_y','ROW_ID_x','DOB','DOD','DOD_HOSP','DOD_SSN','EXPIRE_FLAG'], axis=1)"
      ],
      "execution_count": 0,
      "outputs": []
    },
    {
      "metadata": {
        "id": "8wxUXebAjXX_",
        "colab_type": "code",
        "colab": {},
        "outputId": "9e1f9ff8-a276-4044-fb2f-0fc4563d33cb"
      },
      "cell_type": "code",
      "source": [
        "profs.shape,  admissions.shape,unique_pats.shape"
      ],
      "execution_count": 0,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "((58976, 19), (58976, 19), (46520,))"
            ]
          },
          "metadata": {
            "tags": []
          },
          "execution_count": 5
        }
      ]
    },
    {
      "metadata": {
        "id": "zzFrgiucjXYK",
        "colab_type": "code",
        "colab": {}
      },
      "cell_type": "code",
      "source": [
        "grouped = profs.groupby(['SUBJECT_ID'])\n",
        "samples = unique_pats[range(10000)]"
      ],
      "execution_count": 0,
      "outputs": []
    },
    {
      "metadata": {
        "id": "ptOmAjIUjXYN",
        "colab_type": "code",
        "colab": {}
      },
      "cell_type": "code",
      "source": [
        "tx = graph.begin()\n",
        "# for sub_id in unique_pats[0:1000]:\n",
        "for sub_id in samples:\n",
        "    pat_acts = grouped.get_group(sub_id).sort_values(by=['ADMITTIME'])\n",
        "    last_act = pat_acts.tail(1)\n",
        "    p = Node(\"Patient\", \\\n",
        "             pid=str(last_act.SUBJECT_ID.values[0]),\\\n",
        "             insurance=last_act.INSURANCE.values[0],\\\n",
        "             religion=last_act.RELIGION.values[0],\\\n",
        "             marital=last_act.MARITAL_STATUS.values[0],\\\n",
        "             ethnicity=last_act.ETHNICITY.values[0],\\\n",
        "             gender=last_act.GENDER.values[0])\n",
        "    tx.create(p)\n",
        "    \n",
        "    for index, row in pat_acts.iterrows():\n",
        "        act = Node(\"Activity\", \\\n",
        "                   hadm=row['HADM_ID'],\\\n",
        "                   admit_time=row['ADMITTIME'],\\\n",
        "                   disch_time=row['DISCHTIME'],\\\n",
        "                   admit_type=row['ADMISSION_TYPE'],\\\n",
        "                   admit_loc=row['ADMISSION_LOCATION'],\\\n",
        "                   disch_loc=row['DISCHARGE_LOCATION'],\\\n",
        "                   diag=row['DIAGNOSIS'])\n",
        "        tx.create(act)\n",
        "        hsp = Relationship(p, \"Hospital\", act)\n",
        "        tx.create(hsp)\n",
        "        p = act\n",
        "tx.commit()   \n"
      ],
      "execution_count": 0,
      "outputs": []
    },
    {
      "metadata": {
        "id": "OIFjMcjsjXYQ",
        "colab_type": "code",
        "colab": {}
      },
      "cell_type": "code",
      "source": [
        "df = pd.DataFrame(samples,columns=['pid'])"
      ],
      "execution_count": 0,
      "outputs": []
    },
    {
      "metadata": {
        "id": "hqtKI_BejXYS",
        "colab_type": "code",
        "colab": {}
      },
      "cell_type": "code",
      "source": [
        "#path = pd.DataFrame(graph.data(\"MATCH (n:Patient)-[:Hospital]->(act1)-[:Hospital]->(act) RETURN n.pid as pid, 1 as flag\"))"
      ],
      "execution_count": 0,
      "outputs": []
    },
    {
      "metadata": {
        "id": "ugfOXLYtjXYX",
        "colab_type": "code",
        "colab": {}
      },
      "cell_type": "code",
      "source": [
        "#path.pid = path.pid.astype(int)"
      ],
      "execution_count": 0,
      "outputs": []
    },
    {
      "metadata": {
        "id": "0sdQFUqsjXYd",
        "colab_type": "code",
        "colab": {}
      },
      "cell_type": "code",
      "source": [
        "#df = pd.merge(newData,path,on='pid',how='left')"
      ],
      "execution_count": 0,
      "outputs": []
    },
    {
      "metadata": {
        "id": "zdW3kVfujXYk",
        "colab_type": "code",
        "colab": {}
      },
      "cell_type": "code",
      "source": [
        "adm_type = ['EMERGENCY','ELECTIVE','NEWBORN','URGENT']\n",
        "paths = []\n",
        "for l in range(1,5): \n",
        "    for adm in adm_type:\n",
        "        p = \"MATCH (n:Patient)-[:Hospital*\"+str(l)+\"]->(act) WHERE act.admit_type='\"\\\n",
        "                + adm +\"' RETURN n.pid as pid, 1 as path_\"+str(l)+\"_\"+adm\n",
        "        paths.append(p)"
      ],
      "execution_count": 0,
      "outputs": []
    },
    {
      "metadata": {
        "id": "N7F_CPR_jXYs",
        "colab_type": "code",
        "colab": {},
        "outputId": "bd784c68-9c29-4413-c83e-bdb814598748"
      },
      "cell_type": "code",
      "source": [
        "paths"
      ],
      "execution_count": 0,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[\"MATCH (n:Patient)-[:Hospital*1]->(act) WHERE act.admit_type='EMERGENCY' RETURN n.pid as pid, 1 as path_1_EMERGENCY\",\n",
              " \"MATCH (n:Patient)-[:Hospital*1]->(act) WHERE act.admit_type='ELECTIVE' RETURN n.pid as pid, 1 as path_1_ELECTIVE\",\n",
              " \"MATCH (n:Patient)-[:Hospital*1]->(act) WHERE act.admit_type='NEWBORN' RETURN n.pid as pid, 1 as path_1_NEWBORN\",\n",
              " \"MATCH (n:Patient)-[:Hospital*1]->(act) WHERE act.admit_type='URGENT' RETURN n.pid as pid, 1 as path_1_URGENT\",\n",
              " \"MATCH (n:Patient)-[:Hospital*2]->(act) WHERE act.admit_type='EMERGENCY' RETURN n.pid as pid, 1 as path_2_EMERGENCY\",\n",
              " \"MATCH (n:Patient)-[:Hospital*2]->(act) WHERE act.admit_type='ELECTIVE' RETURN n.pid as pid, 1 as path_2_ELECTIVE\",\n",
              " \"MATCH (n:Patient)-[:Hospital*2]->(act) WHERE act.admit_type='NEWBORN' RETURN n.pid as pid, 1 as path_2_NEWBORN\",\n",
              " \"MATCH (n:Patient)-[:Hospital*2]->(act) WHERE act.admit_type='URGENT' RETURN n.pid as pid, 1 as path_2_URGENT\",\n",
              " \"MATCH (n:Patient)-[:Hospital*3]->(act) WHERE act.admit_type='EMERGENCY' RETURN n.pid as pid, 1 as path_3_EMERGENCY\",\n",
              " \"MATCH (n:Patient)-[:Hospital*3]->(act) WHERE act.admit_type='ELECTIVE' RETURN n.pid as pid, 1 as path_3_ELECTIVE\",\n",
              " \"MATCH (n:Patient)-[:Hospital*3]->(act) WHERE act.admit_type='NEWBORN' RETURN n.pid as pid, 1 as path_3_NEWBORN\",\n",
              " \"MATCH (n:Patient)-[:Hospital*3]->(act) WHERE act.admit_type='URGENT' RETURN n.pid as pid, 1 as path_3_URGENT\",\n",
              " \"MATCH (n:Patient)-[:Hospital*4]->(act) WHERE act.admit_type='EMERGENCY' RETURN n.pid as pid, 1 as path_4_EMERGENCY\",\n",
              " \"MATCH (n:Patient)-[:Hospital*4]->(act) WHERE act.admit_type='ELECTIVE' RETURN n.pid as pid, 1 as path_4_ELECTIVE\",\n",
              " \"MATCH (n:Patient)-[:Hospital*4]->(act) WHERE act.admit_type='NEWBORN' RETURN n.pid as pid, 1 as path_4_NEWBORN\",\n",
              " \"MATCH (n:Patient)-[:Hospital*4]->(act) WHERE act.admit_type='URGENT' RETURN n.pid as pid, 1 as path_4_URGENT\"]"
            ]
          },
          "metadata": {
            "tags": []
          },
          "execution_count": 11
        }
      ]
    },
    {
      "metadata": {
        "id": "JYBMxD_cjXY6",
        "colab_type": "code",
        "colab": {}
      },
      "cell_type": "code",
      "source": [
        "for p in paths:\n",
        "    graphData = graph.data(p)\n",
        "    if(len(graphData)>0):\n",
        "        p_df = pd.DataFrame(graphData)\n",
        "        p_df.pid = p_df.pid.astype(int)\n",
        "        df = pd.merge(df,p_df,on='pid',how='left')"
      ],
      "execution_count": 0,
      "outputs": []
    },
    {
      "metadata": {
        "id": "tzUHMC62jXZG",
        "colab_type": "code",
        "colab": {}
      },
      "cell_type": "code",
      "source": [
        "df = df.fillna(0)"
      ],
      "execution_count": 0,
      "outputs": []
    },
    {
      "metadata": {
        "id": "ahL9dnp6jXZQ",
        "colab_type": "code",
        "colab": {},
        "outputId": "702c367f-9bae-4e28-ce6f-8246242af794"
      },
      "cell_type": "code",
      "source": [
        "df"
      ],
      "execution_count": 0,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/html": [
              "<div>\n",
              "<style scoped>\n",
              "    .dataframe tbody tr th:only-of-type {\n",
              "        vertical-align: middle;\n",
              "    }\n",
              "\n",
              "    .dataframe tbody tr th {\n",
              "        vertical-align: top;\n",
              "    }\n",
              "\n",
              "    .dataframe thead th {\n",
              "        text-align: right;\n",
              "    }\n",
              "</style>\n",
              "<table border=\"1\" class=\"dataframe\">\n",
              "  <thead>\n",
              "    <tr style=\"text-align: right;\">\n",
              "      <th></th>\n",
              "      <th>pid</th>\n",
              "      <th>path_1_EMERGENCY</th>\n",
              "      <th>path_1_ELECTIVE</th>\n",
              "      <th>path_1_NEWBORN</th>\n",
              "      <th>path_1_URGENT</th>\n",
              "      <th>path_2_EMERGENCY</th>\n",
              "      <th>path_2_ELECTIVE</th>\n",
              "      <th>path_2_NEWBORN</th>\n",
              "      <th>path_2_URGENT</th>\n",
              "      <th>path_3_EMERGENCY</th>\n",
              "      <th>path_3_ELECTIVE</th>\n",
              "      <th>path_3_NEWBORN</th>\n",
              "      <th>path_3_URGENT</th>\n",
              "      <th>path_4_EMERGENCY</th>\n",
              "      <th>path_4_ELECTIVE</th>\n",
              "      <th>path_4_URGENT</th>\n",
              "    </tr>\n",
              "  </thead>\n",
              "  <tbody>\n",
              "    <tr>\n",
              "      <th>0</th>\n",
              "      <td>22</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>1</th>\n",
              "      <td>23</td>\n",
              "      <td>0.0</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>2</th>\n",
              "      <td>24</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>3</th>\n",
              "      <td>25</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>4</th>\n",
              "      <td>26</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>5</th>\n",
              "      <td>27</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>6</th>\n",
              "      <td>28</td>\n",
              "      <td>0.0</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>7</th>\n",
              "      <td>30</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>8</th>\n",
              "      <td>31</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>9</th>\n",
              "      <td>32</td>\n",
              "      <td>0.0</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>10</th>\n",
              "      <td>33</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>11</th>\n",
              "      <td>34</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>12</th>\n",
              "      <td>35</td>\n",
              "      <td>0.0</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>13</th>\n",
              "      <td>36</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>14</th>\n",
              "      <td>37</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>15</th>\n",
              "      <td>38</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>16</th>\n",
              "      <td>39</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>17</th>\n",
              "      <td>41</td>\n",
              "      <td>0.0</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>18</th>\n",
              "      <td>357</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>19</th>\n",
              "      <td>358</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>20</th>\n",
              "      <td>359</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>21</th>\n",
              "      <td>360</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>22</th>\n",
              "      <td>361</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>23</th>\n",
              "      <td>362</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>24</th>\n",
              "      <td>363</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>25</th>\n",
              "      <td>364</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>26</th>\n",
              "      <td>365</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>27</th>\n",
              "      <td>366</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>28</th>\n",
              "      <td>367</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>29</th>\n",
              "      <td>368</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>...</th>\n",
              "      <td>...</td>\n",
              "      <td>...</td>\n",
              "      <td>...</td>\n",
              "      <td>...</td>\n",
              "      <td>...</td>\n",
              "      <td>...</td>\n",
              "      <td>...</td>\n",
              "      <td>...</td>\n",
              "      <td>...</td>\n",
              "      <td>...</td>\n",
              "      <td>...</td>\n",
              "      <td>...</td>\n",
              "      <td>...</td>\n",
              "      <td>...</td>\n",
              "      <td>...</td>\n",
              "      <td>...</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>9970</th>\n",
              "      <td>10494</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>9971</th>\n",
              "      <td>10495</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>9972</th>\n",
              "      <td>10496</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>9973</th>\n",
              "      <td>10497</td>\n",
              "      <td>0.0</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>9974</th>\n",
              "      <td>10498</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>9975</th>\n",
              "      <td>10499</td>\n",
              "      <td>0.0</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>9976</th>\n",
              "      <td>10500</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>9977</th>\n",
              "      <td>10501</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>9978</th>\n",
              "      <td>8875</td>\n",
              "      <td>0.0</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>9979</th>\n",
              "      <td>8876</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>9980</th>\n",
              "      <td>8877</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>9981</th>\n",
              "      <td>8878</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>9982</th>\n",
              "      <td>8879</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>9983</th>\n",
              "      <td>8880</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>9984</th>\n",
              "      <td>8881</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>9985</th>\n",
              "      <td>8882</td>\n",
              "      <td>0.0</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>9986</th>\n",
              "      <td>8883</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>9987</th>\n",
              "      <td>8884</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>9988</th>\n",
              "      <td>8885</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>9989</th>\n",
              "      <td>8886</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>9990</th>\n",
              "      <td>8887</td>\n",
              "      <td>0.0</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>9991</th>\n",
              "      <td>8888</td>\n",
              "      <td>0.0</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>9992</th>\n",
              "      <td>8889</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>9993</th>\n",
              "      <td>8890</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>9994</th>\n",
              "      <td>8891</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>9995</th>\n",
              "      <td>8892</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>9996</th>\n",
              "      <td>8893</td>\n",
              "      <td>0.0</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>9997</th>\n",
              "      <td>8894</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>9998</th>\n",
              "      <td>8895</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>9999</th>\n",
              "      <td>8896</td>\n",
              "      <td>0.0</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>1.0</td>\n",
              "      <td>0.0</td>\n",
              "      <td>0.0</td>\n",
              "    </tr>\n",
              "  </tbody>\n",
              "</table>\n",
              "<p>10000 rows  16 columns</p>\n",
              "</div>"
            ],
            "text/plain": [
              "        pid  path_1_EMERGENCY  path_1_ELECTIVE  path_1_NEWBORN  path_1_URGENT  \\\n",
              "0        22               1.0              0.0             0.0            0.0   \n",
              "1        23               0.0              1.0             0.0            0.0   \n",
              "2        24               1.0              0.0             0.0            0.0   \n",
              "3        25               1.0              0.0             0.0            0.0   \n",
              "4        26               1.0              0.0             0.0            0.0   \n",
              "5        27               0.0              0.0             1.0            0.0   \n",
              "6        28               0.0              1.0             0.0            0.0   \n",
              "7        30               0.0              0.0             0.0            1.0   \n",
              "8        31               1.0              0.0             0.0            0.0   \n",
              "9        32               0.0              1.0             0.0            0.0   \n",
              "10       33               1.0              0.0             0.0            0.0   \n",
              "11       34               1.0              0.0             0.0            0.0   \n",
              "12       35               0.0              1.0             0.0            0.0   \n",
              "13       36               1.0              0.0             0.0            0.0   \n",
              "14       37               1.0              0.0             0.0            0.0   \n",
              "15       38               1.0              0.0             0.0            0.0   \n",
              "16       39               0.0              0.0             1.0            0.0   \n",
              "17       41               0.0              1.0             0.0            0.0   \n",
              "18      357               1.0              0.0             0.0            0.0   \n",
              "19      358               0.0              0.0             1.0            0.0   \n",
              "20      359               1.0              0.0             0.0            0.0   \n",
              "21      360               1.0              0.0             0.0            0.0   \n",
              "22      361               1.0              0.0             0.0            0.0   \n",
              "23      362               1.0              0.0             0.0            0.0   \n",
              "24      363               0.0              0.0             1.0            0.0   \n",
              "25      364               1.0              0.0             0.0            0.0   \n",
              "26      365               1.0              0.0             0.0            0.0   \n",
              "27      366               1.0              0.0             0.0            0.0   \n",
              "28      367               1.0              0.0             0.0            0.0   \n",
              "29      368               1.0              0.0             0.0            0.0   \n",
              "...     ...               ...              ...             ...            ...   \n",
              "9970  10494               1.0              0.0             0.0            0.0   \n",
              "9971  10495               0.0              0.0             1.0            0.0   \n",
              "9972  10496               1.0              0.0             0.0            0.0   \n",
              "9973  10497               0.0              1.0             0.0            0.0   \n",
              "9974  10498               1.0              0.0             0.0            0.0   \n",
              "9975  10499               0.0              1.0             0.0            0.0   \n",
              "9976  10500               1.0              0.0             0.0            0.0   \n",
              "9977  10501               1.0              0.0             0.0            0.0   \n",
              "9978   8875               0.0              1.0             0.0            0.0   \n",
              "9979   8876               1.0              0.0             0.0            0.0   \n",
              "9980   8877               0.0              0.0             1.0            0.0   \n",
              "9981   8878               0.0              0.0             1.0            0.0   \n",
              "9982   8879               0.0              0.0             0.0            1.0   \n",
              "9983   8880               1.0              0.0             0.0            0.0   \n",
              "9984   8881               0.0              0.0             1.0            0.0   \n",
              "9985   8882               0.0              1.0             0.0            0.0   \n",
              "9986   8883               1.0              0.0             0.0            0.0   \n",
              "9987   8884               1.0              0.0             0.0            0.0   \n",
              "9988   8885               0.0              0.0             1.0            0.0   \n",
              "9989   8886               1.0              0.0             0.0            0.0   \n",
              "9990   8887               0.0              1.0             0.0            0.0   \n",
              "9991   8888               0.0              1.0             0.0            0.0   \n",
              "9992   8889               1.0              0.0             0.0            0.0   \n",
              "9993   8890               1.0              0.0             0.0            0.0   \n",
              "9994   8891               1.0              0.0             0.0            0.0   \n",
              "9995   8892               1.0              0.0             0.0            0.0   \n",
              "9996   8893               0.0              1.0             0.0            0.0   \n",
              "9997   8894               1.0              0.0             0.0            0.0   \n",
              "9998   8895               1.0              0.0             0.0            0.0   \n",
              "9999   8896               0.0              1.0             0.0            0.0   \n",
              "\n",
              "      path_2_EMERGENCY  path_2_ELECTIVE  path_2_NEWBORN  path_2_URGENT  \\\n",
              "0                  0.0              0.0             0.0            0.0   \n",
              "1                  1.0              0.0             0.0            0.0   \n",
              "2                  0.0              0.0             0.0            0.0   \n",
              "3                  0.0              0.0             0.0            0.0   \n",
              "4                  0.0              0.0             0.0            0.0   \n",
              "5                  0.0              0.0             0.0            0.0   \n",
              "6                  0.0              0.0             0.0            0.0   \n",
              "7                  0.0              0.0             0.0            0.0   \n",
              "8                  0.0              0.0             0.0            0.0   \n",
              "9                  0.0              0.0             0.0            0.0   \n",
              "10                 0.0              0.0             0.0            0.0   \n",
              "11                 1.0              0.0             0.0            0.0   \n",
              "12                 0.0              0.0             0.0            0.0   \n",
              "13                 1.0              0.0             0.0            0.0   \n",
              "14                 0.0              0.0             0.0            0.0   \n",
              "15                 0.0              0.0             0.0            0.0   \n",
              "16                 0.0              0.0             0.0            0.0   \n",
              "17                 0.0              0.0             0.0            0.0   \n",
              "18                 1.0              0.0             0.0            0.0   \n",
              "19                 0.0              0.0             0.0            0.0   \n",
              "20                 0.0              0.0             0.0            0.0   \n",
              "21                 0.0              0.0             0.0            0.0   \n",
              "22                 1.0              0.0             0.0            0.0   \n",
              "23                 1.0              0.0             0.0            0.0   \n",
              "24                 0.0              0.0             0.0            0.0   \n",
              "25                 0.0              0.0             0.0            0.0   \n",
              "26                 0.0              0.0             0.0            0.0   \n",
              "27                 0.0              0.0             0.0            0.0   \n",
              "28                 0.0              0.0             0.0            0.0   \n",
              "29                 1.0              0.0             0.0            0.0   \n",
              "...                ...              ...             ...            ...   \n",
              "9970               0.0              0.0             0.0            0.0   \n",
              "9971               0.0              0.0             0.0            0.0   \n",
              "9972               0.0              0.0             0.0            0.0   \n",
              "9973               0.0              0.0             0.0            0.0   \n",
              "9974               0.0              0.0             0.0            0.0   \n",
              "9975               0.0              0.0             0.0            0.0   \n",
              "9976               0.0              0.0             0.0            0.0   \n",
              "9977               0.0              0.0             0.0            0.0   \n",
              "9978               0.0              0.0             0.0            0.0   \n",
              "9979               1.0              0.0             0.0            0.0   \n",
              "9980               0.0              0.0             0.0            0.0   \n",
              "9981               0.0              0.0             0.0            0.0   \n",
              "9982               0.0              0.0             0.0            0.0   \n",
              "9983               0.0              0.0             0.0            0.0   \n",
              "9984               0.0              0.0             0.0            0.0   \n",
              "9985               0.0              0.0             0.0            0.0   \n",
              "9986               0.0              0.0             0.0            0.0   \n",
              "9987               0.0              0.0             0.0            0.0   \n",
              "9988               0.0              0.0             0.0            0.0   \n",
              "9989               0.0              0.0             0.0            0.0   \n",
              "9990               1.0              0.0             0.0            0.0   \n",
              "9991               0.0              0.0             0.0            0.0   \n",
              "9992               0.0              0.0             0.0            0.0   \n",
              "9993               0.0              0.0             0.0            0.0   \n",
              "9994               0.0              0.0             0.0            0.0   \n",
              "9995               0.0              0.0             0.0            0.0   \n",
              "9996               0.0              0.0             0.0            0.0   \n",
              "9997               0.0              0.0             0.0            0.0   \n",
              "9998               0.0              0.0             0.0            0.0   \n",
              "9999               1.0              0.0             0.0            0.0   \n",
              "\n",
              "      path_3_EMERGENCY  path_3_ELECTIVE  path_3_NEWBORN  path_3_URGENT  \\\n",
              "0                  0.0              0.0             0.0            0.0   \n",
              "1                  0.0              0.0             0.0            0.0   \n",
              "2                  0.0              0.0             0.0            0.0   \n",
              "3                  0.0              0.0             0.0            0.0   \n",
              "4                  0.0              0.0             0.0            0.0   \n",
              "5                  0.0              0.0             0.0            0.0   \n",
              "6                  0.0              0.0             0.0            0.0   \n",
              "7                  0.0              0.0             0.0            0.0   \n",
              "8                  0.0              0.0             0.0            0.0   \n",
              "9                  0.0              0.0             0.0            0.0   \n",
              "10                 0.0              0.0             0.0            0.0   \n",
              "11                 0.0              0.0             0.0            0.0   \n",
              "12                 0.0              0.0             0.0            0.0   \n",
              "13                 0.0              1.0             0.0            0.0   \n",
              "14                 0.0              0.0             0.0            0.0   \n",
              "15                 0.0              0.0             0.0            0.0   \n",
              "16                 0.0              0.0             0.0            0.0   \n",
              "17                 0.0              0.0             0.0            0.0   \n",
              "18                 1.0              0.0             0.0            0.0   \n",
              "19                 0.0              0.0             0.0            0.0   \n",
              "20                 0.0              0.0             0.0            0.0   \n",
              "21                 0.0              0.0             0.0            0.0   \n",
              "22                 0.0              0.0             0.0            0.0   \n",
              "23                 0.0              0.0             0.0            0.0   \n",
              "24                 0.0              0.0             0.0            0.0   \n",
              "25                 0.0              0.0             0.0            0.0   \n",
              "26                 0.0              0.0             0.0            0.0   \n",
              "27                 0.0              0.0             0.0            0.0   \n",
              "28                 0.0              0.0             0.0            0.0   \n",
              "29                 0.0              0.0             0.0            0.0   \n",
              "...                ...              ...             ...            ...   \n",
              "9970               0.0              0.0             0.0            0.0   \n",
              "9971               0.0              0.0             0.0            0.0   \n",
              "9972               0.0              0.0             0.0            0.0   \n",
              "9973               0.0              0.0             0.0            0.0   \n",
              "9974               0.0              0.0             0.0            0.0   \n",
              "9975               0.0              0.0             0.0            0.0   \n",
              "9976               0.0              0.0             0.0            0.0   \n",
              "9977               0.0              0.0             0.0            0.0   \n",
              "9978               0.0              0.0             0.0            0.0   \n",
              "9979               0.0              0.0             0.0            0.0   \n",
              "9980               0.0              0.0             0.0            0.0   \n",
              "9981               0.0              0.0             0.0            0.0   \n",
              "9982               0.0              0.0             0.0            0.0   \n",
              "9983               0.0              0.0             0.0            0.0   \n",
              "9984               0.0              0.0             0.0            0.0   \n",
              "9985               0.0              0.0             0.0            0.0   \n",
              "9986               0.0              0.0             0.0            0.0   \n",
              "9987               0.0              0.0             0.0            0.0   \n",
              "9988               0.0              0.0             0.0            0.0   \n",
              "9989               0.0              0.0             0.0            0.0   \n",
              "9990               1.0              0.0             0.0            0.0   \n",
              "9991               0.0              0.0             0.0            0.0   \n",
              "9992               0.0              0.0             0.0            0.0   \n",
              "9993               0.0              0.0             0.0            0.0   \n",
              "9994               0.0              0.0             0.0            0.0   \n",
              "9995               0.0              0.0             0.0            0.0   \n",
              "9996               0.0              0.0             0.0            0.0   \n",
              "9997               0.0              0.0             0.0            0.0   \n",
              "9998               0.0              0.0             0.0            0.0   \n",
              "9999               1.0              0.0             0.0            0.0   \n",
              "\n",
              "      path_4_EMERGENCY  path_4_ELECTIVE  path_4_URGENT  \n",
              "0                  0.0              0.0            0.0  \n",
              "1                  0.0              0.0            0.0  \n",
              "2                  0.0              0.0            0.0  \n",
              "3                  0.0              0.0            0.0  \n",
              "4                  0.0              0.0            0.0  \n",
              "5                  0.0              0.0            0.0  \n",
              "6                  0.0              0.0            0.0  \n",
              "7                  0.0              0.0            0.0  \n",
              "8                  0.0              0.0            0.0  \n",
              "9                  0.0              0.0            0.0  \n",
              "10                 0.0              0.0            0.0  \n",
              "11                 0.0              0.0            0.0  \n",
              "12                 0.0              0.0            0.0  \n",
              "13                 0.0              0.0            0.0  \n",
              "14                 0.0              0.0            0.0  \n",
              "15                 0.0              0.0            0.0  \n",
              "16                 0.0              0.0            0.0  \n",
              "17                 0.0              0.0            0.0  \n",
              "18                 1.0              0.0            0.0  \n",
              "19                 0.0              0.0            0.0  \n",
              "20                 0.0              0.0            0.0  \n",
              "21                 0.0              0.0            0.0  \n",
              "22                 0.0              0.0            0.0  \n",
              "23                 0.0              0.0            0.0  \n",
              "24                 0.0              0.0            0.0  \n",
              "25                 0.0              0.0            0.0  \n",
              "26                 0.0              0.0            0.0  \n",
              "27                 0.0              0.0            0.0  \n",
              "28                 0.0              0.0            0.0  \n",
              "29                 0.0              0.0            0.0  \n",
              "...                ...              ...            ...  \n",
              "9970               0.0              0.0            0.0  \n",
              "9971               0.0              0.0            0.0  \n",
              "9972               0.0              0.0            0.0  \n",
              "9973               0.0              0.0            0.0  \n",
              "9974               0.0              0.0            0.0  \n",
              "9975               0.0              0.0            0.0  \n",
              "9976               0.0              0.0            0.0  \n",
              "9977               0.0              0.0            0.0  \n",
              "9978               0.0              0.0            0.0  \n",
              "9979               0.0              0.0            0.0  \n",
              "9980               0.0              0.0            0.0  \n",
              "9981               0.0              0.0            0.0  \n",
              "9982               0.0              0.0            0.0  \n",
              "9983               0.0              0.0            0.0  \n",
              "9984               0.0              0.0            0.0  \n",
              "9985               0.0              0.0            0.0  \n",
              "9986               0.0              0.0            0.0  \n",
              "9987               0.0              0.0            0.0  \n",
              "9988               0.0              0.0            0.0  \n",
              "9989               0.0              0.0            0.0  \n",
              "9990               0.0              0.0            0.0  \n",
              "9991               0.0              0.0            0.0  \n",
              "9992               0.0              0.0            0.0  \n",
              "9993               0.0              0.0            0.0  \n",
              "9994               0.0              0.0            0.0  \n",
              "9995               0.0              0.0            0.0  \n",
              "9996               0.0              0.0            0.0  \n",
              "9997               0.0              0.0            0.0  \n",
              "9998               0.0              0.0            0.0  \n",
              "9999               1.0              0.0            0.0  \n",
              "\n",
              "[10000 rows x 16 columns]"
            ]
          },
          "metadata": {
            "tags": []
          },
          "execution_count": 14
        }
      ]
    }
  ]
}